{
  "石狩市": "日本海に面した街で、石狩鍋の発祥地として知られている。石狩川河口周辺は自然と歴史の両面で見どころが多い。",
  "当別町": "札幌近郊にあり、スウェーデンとの交流が盛んな町として知られている。北欧風の街並みや自然環境が特徴。",
  "新篠津村": "広大な田園風景が広がる農村で、米作りが盛んな地域として知られている。しのつ湖周辺は憩いの場として親しまれている。",
  "岩見沢市": "空知地方の中心都市で、かつて炭鉱と鉄道で発展した歴史を持つ。現在は公園やイベントを通じた街づくりが進んでいる。",
  "美唄市": "炭鉱の歴史を背景に発展した街で、現在は自然と食文化が魅力となっている。美唄焼き鳥はご当地グルメとして知られる。",
  "芦別市": "かつて炭鉱で栄えた街で、「星の降る里」として知られている。豊かな自然と静かな環境が特徴。",
  "赤平市": "炭鉱の歴史を色濃く残す街で、産業遺産が点在している。自然に囲まれた落ち着いた雰囲気も魅力。",
  "三笠市": "北海道の石炭産業発祥の地として知られている。アンモナイト化石の産地でもあり、地質的にも注目されている。",
  "夕張市": "夕張メロンで全国的に知られている街。炭鉱の歴史とともに観光資源の再生が進められている。",
  "滝川市": "空知地方の交通の要所として発展してきた街。菜の花畑が春の風物詩として親しまれている。",
  "砂川市": "スイーツの街として知られ、多くの菓子店が集まっている。市内を流れる石狩川の景観も特徴。",
  "歌志内市": "日本で最も人口の少ない市として知られている。炭鉱の歴史と静かな自然環境が残る街。",
  "深川市": "米どころとして知られ、良質な農産物の生産が盛ん。石狩川沿いの自然と食文化が魅力。",
  "南幌町": "札幌近郊の農業が盛んな町で、野菜の生産が知られている。子育て支援に力を入れている地域としても注目される。",
  "奈井江町": "石狩川沿いに位置し、農業と工業がバランスよく発展している。公園や自然環境が整備された住みやすい町。",
  "上砂川町": "炭鉱の町として栄えた歴史を持つ。現在は自然に囲まれた静かな暮らしが特徴。",
  "由仁町": "農業が盛んな町で、由仁ガーデンなど観光スポットも知られている。のどかな田園風景が広がる。",
  "長沼町": "広大な農地が広がる農業の町で、ハスカップなどの特産品が知られている。札幌へのアクセスも良い。",
  "栗山町": "酒蔵の町として知られ、小林酒造が観光名所になっている。農業と歴史が調和した地域。",
  "月形町": "樺戸集治監の歴史を持つ町で、北海道開拓の歴史を感じられる。自然と歴史が共存する地域。",
  "浦臼町": "農業を中心とした町で、特に米の生産が知られている。石狩川沿いの自然環境が特徴。",
  "新十津川町": "奈良県十津川村からの集団移住によって開かれた町。開拓の歴史を今に伝えている。",
  "妹背牛町": "米作りが盛んな小さな町で、のどかな田園風景が広がる。地域に根ざした農業が特徴。",
  "秩父別町": "花と緑のまちづくりが進められている町。農業体験など交流型観光も行われている。",
  "雨竜町": "暑寒別岳のふもとに広がり、自然に恵まれた町。農業とアウトドアの拠点として知られる。",
  "北竜町": "ひまわりの里として有名で、夏には一面のひまわり畑が広がる。農業を中心とした町。",
  "沼田町": "稲作が盛んな町で、夏の夜高あんどん祭りが知られている。石狩川流域の自然が魅力。",
  "蘭越町": "羊蹄山の西側に位置し、良質な米の産地として知られている。温泉や自然景観も楽しめる。",
  "ニセコ町": "世界的に知られるスキーリゾートを有し、海外からの観光客も多い。自然と観光が融合した町。",
  "真狩村": "羊蹄山のふもとに広がる農村で、自然環境に恵まれている。詩人・細川たかしの出身地としても知られる。",
  "留寿都村": "ルスツリゾートを中心に観光業が発展している村。農業とリゾートが共存する地域。",
  "喜茂別町": "羊蹄山周辺の農業地域で、じゃがいもなどの栽培が盛ん。山間の自然に囲まれた町。",
  "京極町": "名水の里として知られ、羊蹄山の湧水が観光資源になっている。清らかな水環境が魅力。",
  "倶知安町": "ニセコエリアの中心的な町で、冬はスキー観光でにぎわう。農業と観光の両立が特徴。",
  "共和町": "農業が基幹産業で、じゃがいもや小麦の生産が盛ん。広い大地と山々に囲まれている。",
  "岩内町": "日本海に面した港町で、漁業と観光が盛んな地域。岩内岳など自然景観も楽しめる。",
  "泊村": "原子力発電所が立地する村として知られている。海岸線の景観と漁業も地域の特徴。",
  "神恵内村": "日本海に面した小さな村で、断崖と海の景観が印象的。漁業が生活の基盤となっている。",
  "積丹町": "積丹ブルーと呼ばれる透明度の高い海が有名。夏はウニなど海の幸を目当てに観光客が訪れる。",
  "古平町": "漁業の町として知られ、特にタラコの生産が盛ん。港町らしい風景が残っている。",
  "余市町": "ニッカウヰスキー余市蒸溜所があり、ウイスキーの町として知られる。果樹栽培も盛ん。",
  "赤井川村": "後志地方で唯一の村で、自然豊かな環境に恵まれている。農業とアウトドア観光が特徴。",
  "名寄市": "道北の拠点都市の一つで、冬は雪質の良さを生かしたウィンタースポーツが親しまれている。ひまわり畑の景観も季節の名物として知られる。",
  "士別市": "羊のまちとして知られ、サフォーク種の羊が地域のシンボルになっている。天塩川沿いの自然環境も魅力。",
  "鷹栖町": "旭川近郊の農業の町で、米や野菜の生産が盛ん。落ち着いた住環境と田園風景が広がっている。",
  "東神楽町": "旭川空港が立地し、道内外へのアクセス拠点となっている。農業と住宅地が調和した町。",
  "当麻町": "鍾乳洞や花畑など自然を生かした観光資源がある町。米やでんすけすいかの産地としても知られる。",
  "比布町": "稲作が盛んな農業の町で、のどかな田園風景が広がる。スキー場など冬のレジャーも親しまれている。",
  "愛別町": "きのこの生産が盛んで、きのこの里として知られている。石狩川沿いの自然に囲まれた町。",
  "上川町": "大雪山国立公園の玄関口として知られ、層雲峡温泉が観光名所になっている。登山や自然観光の拠点。",
  "東川町": "大雪山連峰を望む景観が美しく、写真文化の町として知られている。地下水が豊富で水のおいしさも特徴。",
  "上富良野町": "ラベンダー畑と十勝岳連峰の景観が観光の見どころ。農業と観光が調和した町。",
  "中富良野町": "富良野盆地の中央に位置し、ラベンダーや花畑が広がる。落ち着いた雰囲気の観光地として知られる。",
  "南富良野町": "アウトドア活動が盛んで、ラフティングやキャンプが楽しめる地域。かなやま湖周辺は観光スポット。",
  "占冠村": "道東と道北を結ぶ交通の要所に位置する村。森林資源に恵まれ、自然の多さが特徴。",
  "和寒町": "かぼちゃの生産量が多く、特産品として知られている。農業を基盤とした静かな町。",
  "剣淵町": "絵本の里として知られ、町全体で絵本文化の発信に取り組んでいる。農業と文化が結びついた地域。",
  "下川町": "森林資源を生かした町づくりが進められている。持続可能な林業の取り組みでも知られる。",
  "美深町": "天塩川沿いに広がる町で、チョウザメの養殖が話題になっている。自然と食の特色がある地域。",
  "音威子府村": "人口の少ない村として知られ、そばの産地としても有名。静かな山間の環境が特徴。",
  "中川町": "天塩川と山々に囲まれた自然豊かな町。化石の発見地としても知られている。",
  "幌加内町": "そばの作付面積が日本有数で、「そばの里」として知られている。冬の寒さが厳しい地域でもある。",
  "留萌市": "日本海に面した港町で、かつてニシン漁で栄えた歴史を持つ。現在は夕日の美しさでも知られている。",
  "増毛町": "歴史ある港町で、ニシン漁とともに発展してきた。果樹栽培や酒蔵の町としても知られている。",
  "小平町": "海岸線と山間部を併せ持つ町で、漁業と農業が行われている。静かな自然環境が特徴。",
  "苫前町": "風力発電の風車が並ぶ景観が印象的な町。農業と再生可能エネルギーが地域の特徴になっている。",
  "羽幌町": "天売島・焼尻島への玄関口として知られている。漁業が盛んで、海産物が豊富な地域。",
  "初山別村": "日本海に沈む夕日が美しい村として知られている。天文台やキャンプ場など自然を生かした施設がある。",
  "遠別町": "日本最北の米どころとして知られ、農業が盛んな町。天塩川流域の自然に恵まれている。",
  "天塩町": "天塩川の河口に位置し、しじみ漁が特産として知られている。広大な湿地と自然景観が特徴。",
  "猿払村": "ホタテの養殖が盛んで、日本有数の生産地として知られている。オホーツク海沿いの自然が広がる。",
  "浜頓別町": "クッチャロ湖を有し、水鳥の飛来地として知られている。漁業と酪農が行われる町。",
  "中頓別町": "山間部に位置し、森林資源に恵まれた町。静かな自然環境の中で農業や林業が営まれている。",
  "枝幸町": "オホーツク海に面した漁業の町で、毛ガニなどの水産物が知られている。流氷の季節も見どころ。",
  "豊富町": "酪農が盛んな町で、サロベツ原野に広がる牧草地が特徴。温泉地としても知られている。",
  "礼文町": "高山植物が咲き誇る「花の島」として知られている。夏でも涼しく、自然散策が人気。",
  "利尻町": "利尻山のふもとに広がる町で、漁業と観光が基幹産業。ウニや昆布など海の幸が豊富。",
  "利尻富士町": "利尻山を望む景観が美しく、登山客や観光客が訪れる。自然と共に暮らす島の町。",
  "幌延町": "広大な湿原と牧草地が広がる町で、トナカイ観光が知られている。自然研究の拠点としても注目されている。",
  "北見市": "オホーツク圏最大の都市で、玉ねぎの生産量が日本有数として知られている。冬は流氷観光の拠点にもなる。",
  "網走市": "流氷が接岸する街として有名で、冬のオホーツク海の景観が見どころ。博物館網走監獄は歴史観光地として知られている。",
  "紋別市": "流氷観光の拠点で、流氷砕氷船ガリンコ号が名物。オホーツク海に面した港町。",
  "美幌町": "美幌峠から望む屈斜路湖の景色が有名。農業が盛んな町で、広大な畑作地帯が広がる。",
  "津別町": "森林資源に恵まれた町で、木工や林業が地域産業の一つ。清流と山々に囲まれた自然豊かな環境。",
  "斜里町": "知床半島の玄関口として知られ、世界自然遺産へのアクセス拠点となっている。農業と観光が両立する町。",
  "清里町": "斜里岳のふもとに広がる農業の町。清らかな水と自然環境に恵まれている。",
  "小清水町": "オホーツク海と濤沸湖に挟まれた自然豊かな町。原生花園では季節の花々が楽しめる。",
  "訓子府町": "農業を基盤とした町で、玉ねぎや麦の生産が盛ん。落ち着いた田園風景が広がる。",
  "置戸町": "森林資源が豊富で、木工や林業が盛んな町。自然体験やアウトドアが楽しめる地域。",
  "佐呂間町": "サロマ湖に面し、ホタテ養殖が盛んな町として知られている。湖と海の景観が魅力。",
  "遠軽町": "太平洋戦争時代に開拓が進んだ地域で、現在は農業が中心。太陽の丘えんがる公園のコスモスが有名。",
  "湧別町": "サロマ湖に面し、チューリップ畑が観光名所として知られている。農業と漁業が行われる町。",
  "滝上町": "芝ざくらの名所として全国的に知られている。春には丘一面が花で覆われる。",
  "興部町": "酪農が盛んな町で、乳製品の生産が地域の特徴。オホーツク海沿いの自然景観も魅力。",
  "西興部村": "酪農と森林に囲まれた村で、静かな暮らしが特徴。自然体験型の観光も行われている。",
  "雄武町": "オホーツク海に面した漁業の町で、毛ガニなどの水産物が知られている。雄大な海岸線が続く。",
  "大空町": "女満別空港を有し、オホーツク観光の玄関口となっている。農業が盛んな地域でもある。",
  "音更町": "十勝平野の中央部に位置し、農業が盛んな町として知られている。十勝川温泉はモール温泉で有名。",
  "士幌町": "畑作と酪農が盛んな町で、じゃがいもや牛肉の産地として知られている。広大な農地が広がる十勝らしい風景が特徴。",
  "上士幌町": "糠平湖とタウシュベツ川橋梁で知られ、自然景観と歴史的構造物が見どころ。酪農と観光が地域を支えている。",
  "鹿追町": "大雪山国立公園の南側に位置し、自然に囲まれた町。鹿追そばなど農産物も知られている。",
  "新得町": "そばの産地として全国的に知られている。狩勝峠周辺の山岳景観も見どころ。",
  "清水町": "十勝清水牛など畜産が盛んな町。日高山脈のふもとに広がる自然環境が特徴。",
  "芽室町": "畑作農業が盛んで、小麦や豆類の生産が知られている。十勝平野の中でも農業景観が美しい地域。",
  "中札内村": "枝豆の産地として知られ、農業を中心とした村。六花の森など文化と自然を楽しめる場所もある。",
  "更別村": "農業が基幹産業で、広い畑が整然と広がる村。十勝スピードウェイが立地することでも知られている。",
  "大樹町": "宇宙航空関連の実験が行われる町として注目されている。農業と最先端研究が共存する地域。",
  "広尾町": "太平洋に面した港町で、漁業と農業が行われている。サンタランドとしても知られている。",
  "幕別町": "パークゴルフ発祥の地として知られ、全国から愛好者が訪れる。農業と住宅地が広がる町。",
  "池田町": "十勝ワインの産地として知られ、ワイナリーが観光名所になっている。ぶどう栽培が盛んな地域。",
  "豊頃町": "十勝川河口付近に位置し、冬に見られるジュエリーアイスが話題になっている。自然景観が魅力の町。",
  "本別町": "豆類の生産が盛んな農業の町として知られている。義経伝説が残る地域でもある。",
  "足寄町": "北海道で最も面積が広い町で、広大な自然に囲まれている。松山千春の出身地としても知られる。",
  "陸別町": "日本一寒い町として知られ、冬の厳しい寒さが特徴。天文台など星空観察の環境も整っている。",
  "浦幌町": "太平洋に面し、漁業と農業が行われている町。海岸線と内陸の自然が共存している。",
  "釧路町": "釧路湿原に隣接し、タンチョウの生息地として知られている。自然と住宅地が近接した環境が特徴。",
  "厚岸町": "牡蠣の産地として全国的に知られている港町。厚岸湖と厚岸湾に囲まれた水辺の景観が魅力。",
  "浜中町": "霧の多い地域として知られ、酪農が盛んな町。ルパン三世の作者・モンキー・パンチの出身地でもある。",
  "標茶町": "釧路湿原の内陸部に位置し、酪農が盛んな地域。SL冬の湿原号が走る町としても知られている。",
  "弟子屈町": "摩周湖や屈斜路湖を有する自然豊かな町。温泉地としても知られ、観光と自然が共存している。",
  "鶴居村": "タンチョウの観察地として有名で、冬には多くの観光客が訪れる。牧草地が広がる酪農の村。",
  "白糠町": "太平洋に面し、漁業と酪農が行われている町。自然に囲まれた落ち着いた環境が特徴。",
  "根室市": "日本最東端の都市として知られ、花咲ガニの産地として有名。海に囲まれた立地が特徴。",
  "別海町": "酪農が非常に盛んな町で、生乳生産量が全国有数。広大な牧草地が広がる。",
  "中標津町": "道東の交通拠点として発展してきた町。酪農と商業がバランスよく共存している。",
  "標津町": "サケの町として知られ、標津サーモン科学館が観光名所。オホーツク海沿いの自然が広がる。",
  "羅臼町": "知床半島の東側に位置し、世界自然遺産の海域を有する町。シャチやクジラの観察でも知られている。",
  "室蘭市": "工業都市として発展し、夜には工場群が生み出す工場夜景が楽しめる。白鳥大橋は街のシンボル的存在。",
  "苫小牧市": "北海道有数の港湾都市で、フェリーの発着地として道外への玄関口になっている。ウトナイ湖は野鳥観察地として知られる。",
  "登別市": "登別温泉の地獄谷が有名で、噴気孔や湯けむりが迫力ある景観をつくっている。多様な泉質が楽しめる温泉地。",
  "伊達市": "温暖な気候を生かした農業が盛んな街。武家屋敷跡など歴史を感じる景観も残っている。",
  "豊浦町": "噴火湾に面し、ホタテ養殖が盛んな町として知られている。海と山に囲まれた自然環境が魅力。",
  "洞爺湖町": "洞爺湖と有珠山に囲まれた景勝地で、温泉リゾートとして知られている。湖畔の景観と花火大会が人気。",
  "壮瞥町": "有珠山や昭和新山に近く、火山の恵みを感じられる町。果樹栽培も盛んで農業が地域を支えている。",
  "白老町": "アイヌ文化の発信地として知られ、ウポポイで伝統文化に触れられる。温泉や海の幸も魅力。",
  "厚真町": "農業と酪農が盛んな町で、豊かな田園風景が広がる。胆振東部地震からの復興が進められている。",
  "安平町": "競走馬の生産地として知られ、全国的に有名な馬産地の一つ。農業と畜産が盛んな町。",
  "むかわ町": "恐竜化石の発見地として注目されている。漁業と農業が行われ、自然と歴史が共存する地域。",
  "日高町": "日高山脈に近く、自然に囲まれた町。スキー場などアウトドア活動の拠点としても利用される。",
  "平取町": "アイヌ文化と沙流川流域の自然が色濃く残る町。びらとり和牛など特産品も知られている。",
  "新冠町": "競走馬の産地として知られ、レコード館など音楽文化にも力を入れている。海と牧場の風景が特徴。",
  "浦河町": "競走馬の育成地として全国的に知られている。港町として漁業も行われている。",
  "様似町": "アポイ岳を有し、高山植物の宝庫として知られている。地質学的にも貴重な地域。",
  "えりも町": "えりも岬の強風と霧で知られ、アザラシの生息地としても有名。厳しい自然環境が特徴。",
  "新ひだか町": "日本有数の競走馬産地で、サラブレッドの牧場が多い。静内の桜並木は春の名所。",
  "函館市": "函館山からの夜景が有名で、港町らしい風景が楽しめる。五稜郭は星形の城郭として知られる。",
  "北斗市": "函館近郊に位置し、新函館北斗駅を有する交通の要所。農業と住宅地が調和した街。",
  "七飯町": "大沼国定公園を有し、湖と山の自然景観が楽しめる町。農業も盛んな地域。",
  "松前町": "北海道唯一の城下町で、松前城と桜の名所として知られている。歴史観光が魅力。",
  "福島町": "青函トンネル記念館があり、交通の歴史を学べる町。漁業が盛んな地域。",
  "知内町": "ニラの生産量が多く、特産品として知られている。青函トンネルの北海道側入口がある。",
  "木古内町": "新幹線駅があり、本州との玄関口となっている町。歴史ある街道文化も残る。",
  "森町": "噴火湾に面し、いかめし発祥の地として知られている。海産物と観光が魅力。",
  "八雲町": "太平洋と日本海の両方に面する珍しい町。酪農や漁業が盛んな地域。",
  "長万部町": "鉄道の要衝として発展してきた町。かにめし駅弁が名物として知られる。",
  "江差町": "ニシン漁で栄えた歴史を持ち、江差追分が伝統芸能として受け継がれている。歴史的建物も多い。",
  "上ノ国町": "北海道開拓の初期から栄えた歴史ある町。中世の遺跡や海岸線の景観が見どころ。",
  "厚沢部町": "農業が盛んな町で、特にメークイン発祥の地として知られている。のどかな田園風景が広がる。",
  "乙部町": "日本海に面し、断崖が続く海岸線が特徴。漁業を中心とした静かな町。",
  "奥尻町": "日本海に浮かぶ離島の町で、透明度の高い海が魅力。自然とともに暮らす島の文化が残る。",
  "今金町": "農業が盛んな町で、今金男しゃくいもが特産品として知られている。清流と山に囲まれた環境が特徴。",
  "せたな町": "日本海に面し、海岸景観と漁業が特徴の町。奇岩が点在する海岸線が見どころ。"
}